OpenFOAM/OpenFOAM-2.2.x/tutorials/heatTransfer/buoyantSimpleFoam/hotRoom/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh
runApplication setFields
runApplication $application

# ----------------------------------------------------------------- end-of-file
